[
  {
    "id": 1,
    "title": "We're Live!",
    "date": "09-14-2025",
    "content": "",
    "summary": "Today marks the occasion of me finally finishing the first version of my portfolio website (this one)! I hadn’t finished a website 100% independently before now. I had a great time! My mind is already buzzing with the possibilities of how to improve it.",
    "image": "./thumbnail.png"
  },
  {
    "id": 2,
    "title": "Goodbye MS Word :(",
    "date": "08-28-2025",
    "content": "Hello Kind Reader,\nToday I opened up Microsoft Word to take notes on the autonomic nervous system, when I saw a tiny yellow banner at the top announcing terrible news:\nMS WORD IS NO LONGER!!\nSo I, of course, got to scheming. Definitely one of my favorite things to do is imagine projects that would take a lot of time and effort. As 4th grade me once wrote in scribbled cursive, I am a dreamer.\nTo the crux of the scheme!\nWHY:\nMicrosoft is ending support for Word. :(\nIt's $99 for HOME USE(!!). Plus, Microsoft steals your data and sends it to freaking B**kR**k so they can buy everything you own and sell it back to you.\nJust jokes of course (ᵕ—ᴗ—)\nWord is BY FAR my favorite text editor - it's incredibly capable! It's that capability that makes it worth using despite its drawback of having an overwhelming amount of buttons and options and menu spaghetti. Now, some may say \"oh just use Google Docs\" - WRONG! that sucks too, just another megacorporation trying to turn America into one big company town.\nWho said that???\nAlso, Minecraft. Did you know Mojang is (allegedly) getting sued in a class action lawsuit? They actually just changed their terms of service to say you can't do that... kinda weird...\nHOW:\nI need to really study Word if I want to do this. I think I could start taking screenshots or something, taking notes for each one and make a sort of storyboard. Maybe even do some nitty gritty use case flows.\nWHEN:\nMicrosoft is ending support on October 14th, 2025.\nI will try to finish a minimally interactive version of my portfolio website, possibly within the first week of October, so I can get lots of good references before it is gone forever.\nNext time you hear from me, I will hopefully have some sort of file to link containing my research.\nUntil then,\n✿ Celeste ✿",
    "summary": "Today I opened up Microsoft Word to take notes on the autonomic nervous system, when I saw a tiny yellow banner at the top announcing terrible news: MS WORD IS NO LONGER!! So I, of course, got to scheming.",
    "image": "./thumbnail.png"
  }
]